src/main/resources/com/ovea/billing/support/bango-status.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="com.bango.webservices.subscriptions">
   <soapenv:Header/>
   <soapenv:Body>
      <com:GetSubscriptionInfo>
         <com:request>
            <com:username>${username}</com:username>
            <com:password>${password}</com:password>
            <com:subscriptionId>${event.data.id}</com:subscriptionId>
         </com:request>
      </com:GetSubscriptionInfo>
   </soapenv:Body>
</soapenv:Envelope>